src/InformationRegisters/гф_ОтслеживаемыеОригиналыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ОтслеживаемыеОригиналыПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/УчетОригиналовПервичныхДокументов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// #wortmann {
// #
// Галфинд Окунев 2022/08/14
// Удаляет из списков объекты и формы, отсутствующие в регистре
// гф_ОтслеживаемыеОригиналыПервичныхДокументов, при условии, что в нем есть записи
//
// Параметры:
//
// ОбъектыПечати	- СписокЗначений
// СписокПечати		- СписокЗначений
//
&После("ПриОпределенииСпискаПечатныхФорм")
Процедура гф_ПриОпределенииСпискаПечатныхФорм(ОбъектыПечати, СписокПечати) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Имя КАК ВидДокумента,
	|	гф_ОтслеживаемыеОригиналыПервичныхДокументов.ПервичныйДокумент КАК ПервичныйДокумент
	|ИЗ
	|	РегистрСведений.гф_ОтслеживаемыеОригиналыПервичныхДокументов КАК гф_ОтслеживаемыеОригиналыПервичныхДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО гф_ОтслеживаемыеОригиналыПервичныхДокументов.ВидДокумента = ИдентификаторыОбъектовМетаданных.Ссылка";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;	      
	
	ТаблицаРегистрируемых = Результат.Выгрузить();
	
	ФормыКУдалению = Новый Массив;

	Для Каждого Документ Из ОбъектыПечати Цикл

		Для Каждого ПечатнаяФорма Из СписокПечати Цикл
			
			ОтборДокументовФорм = Новый Структура("ВидДокумента, ПервичныйДокумент",
				 Документ.Значение.Метаданные().Имя, ПечатнаяФорма.Значение);
				 
			СтрокиРегистрируемых = ТаблицаРегистрируемых.НайтиСтроки(ОтборДокументовФорм);	 
			
			Если СтрокиРегистрируемых.Количество() = 0 Тогда
				
				ФормыКУдалению.Добавить(ПечатнаяФорма);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Для Каждого ПечатнаяФорма Из ФормыКУдалению Цикл
		
		СписокПечати.Удалить(ПечатнаяФорма);
		
	КонецЦикла;	
	
	Если СписокПечати.Количество() = 0 Тогда   
		
		ОбъектыПечати.Очистить();
		
	КонецЕсли;	
	
КонецПроцедуры// } #wortmann

#КонецОбласти
